<script>
import { mapState } from "vuex";

export default {
  data: () => {
    return {
      // @todo
    };
  },
  computed: {
    ...mapState(["aboutMe"]),
  },
};
</script>

<template>
  <div class="block sm:flex sm:gap-10 mt-10 sm:mt-20">
    <!-- About profile image -->
    <div class="w-full sm:w-1/4 mb-7 sm:mb-0">
      <img src="~/static/logo-light.svg" class="rounded-lg w-96" alt="" />
    </div>

    <!-- About details -->
    <div class="w-full sm:w-3/4 text-left">
      <h2><strong>Основное направление нашего центра дополнительного образования:</strong></h2>
      <ul>
        <li>обучение парикмахерскому искусству,</li>
        <li>обучение косметологии и аппаратной косметологии,</li>
        <li>обучение всем техникам наращивания ногтей акрилом и гелем,</li>
        <li>обучение маникюру,</li>
        <li>обучение педикюру,</li>
        <li>обучение татуажу,</li>
        <li>курсы наращивания волос,</li>
        <li>курсы наращивания ресниц</li>
        <li>ламинирование ресниц</li>
        <li>повышение квалификации по инъекционным методикам (мезотерапия и биоривитализация, контурная пластика, БТА, мезонити)</li>
      </ul>
      <br>
      <h2 style="text-align: justify;">
        <span style="font-size: 14pt; color: #993366;">Особенностью школы является индивидуальный подход.</span>
      </h2>
      <p style="text-align: justify;">Небольшое количество учеников позволяет преподавателю внимательно следить за работой каждого ученика. Особое внимание в процессе обучения на курсах кроме теории, уделяется практическим занятиям на моделях. С ежедневной практикой ученик накапливает опыт и уверенность, необходимые ему для дальнейшей работы. Но Вы можете выбрать сами себе график обучения. Все необходимые материалы входят в <strong>стоимость курсов</strong>. Занятия проводят опытные преподаватели. По окончании курсов выдается свидетельство международного образца и оказывается помощь в трудоустройстве. Занятия проходят в центре Москвы.</p>
    </div>
  </div>
</template>
