<script>
import { mapState } from "vuex";

export default {
  data: () => {
    return {
      // @todo
    };
  },
  computed: {
    ...mapState(["aboutMe"]),
  },
};
</script>

<template>
  <div class="container">
    <div class="sm:flex sm:flex-wrap mt-11">
      <!-- About profile image -->
      <div class="w-full sm:w-1/4 mb-7 pr-12 sm:mb-0">
        <img src="~/static/cs-dark.svg" class="rounded-lg w-96" alt="" />
      </div>

      <!-- About details -->
      <div class="w-full sm:w-3/4 text-left">
        <p>Полное наименование: АВТОНОМНАЯ НЕКОММЕРЧЕСКАЯ ОРГАНИЗАЦИЯ ДОПОЛНИТЕЛЬНОГО ПРОФЕССИОНАЛЬНОГО ОБРАЗОВАНИЯ «ИНСТИТУТ КОСМЕТОЛОГИИ. ЦЕНТР ПОВЫШЕНИЯ КВАЛИФИКАЦИИ»
        <p>Сокращенное наименование: АНО ДПО «ИНСТИТУТ КОСМЕТОЛОГИИ»</p>
        <p>Наш учебный центр существует уже более 10 лет, в настоящее время мы открылись после ремонта в новом благоустроенном здании, радом с 2-мя станциями метро (Цветной бульвар и Сухаревская). В нашем учебном центре большое количество просторных учебных классов, а также классов для практических работ, кабинетом колористики волос, кабинетом инъекционной косметологии, массажным кабинетом и кабинетами аппаратной косметологии.</p>
        <p>В нашем центре преподают высококвалифицированные специалисты, все преподаватели имеют медицинское образование, регулярно проходят курсы повышения квалификации и имеют различные регалии!</p>
        <p>Наш учебный центр предлагает большое количество разнообразных курсов по косметологии как для людей, имеющих среднее и высшее медицинское образование желающих повысить квалификацию, так и для людей, не имеющих медицинского образования, но имеющих желание пройти обучение и получить новую интересную и полезную профессию – косметолог – эстетист!</p>
        <p>Наш учебный центр предлагает удобный график обучения, включая индивидуальное обучение, различные варианты оплаты и рассрочку!</p>
        <p>Мы работаем для Вас!</p>

        <h2><strong>Основное направление нашего центра дополнительного образования:</strong></h2>
        <ul>
          <li>обучение парикмахерскому искусству,</li>
          <li>обучение косметологии и аппаратной косметологии,</li>
          <li>обучение всем техникам наращивания ногтей акрилом и гелем,</li>
          <li>обучение маникюру,</li>
          <li>обучение педикюру,</li>
          <li>обучение татуажу,</li>
          <li>курсы наращивания волос,</li>
          <li>курсы наращивания ресниц</li>
          <li>ламинирование ресниц</li>
          <li>повышение квалификации по инъекционным методикам (мезотерапия и биоривитализация, контурная пластика, БТА, мезонити)</li>
        </ul>
        <br>
        <h2 style="text-align: justify;">
          <span style="font-size: 14pt; color: #993366;">Особенностью школы является индивидуальный подход.</span>
        </h2>
        <p style="text-align: justify;">Небольшое количество учеников позволяет преподавателю внимательно следить за работой каждого ученика. Особое внимание в процессе обучения на курсах кроме теории, уделяется практическим занятиям на моделях. С ежедневной практикой ученик накапливает опыт и уверенность, необходимые ему для дальнейшей работы. Но Вы можете выбрать сами себе график обучения. Все необходимые материалы входят в <strong>стоимость курсов</strong>. Занятия проводят опытные преподаватели. По окончании курсов выдается свидетельство международного образца и оказывается помощь в трудоустройстве. Занятия проходят в центре Москвы.</p>
      </div>
    </div>
  </div>
</template>
